<template>
  <div>
    <Header />
    <div class="m-6">
      <h3 class="mb-4 font-semibold">Статистика за день </h3>
      <div class="grid grid-cols-3 gap-8">
        <div class="bg-white rounded-lg">
          <div class="flex px-4 py-5">
            <div class="flex items-center bg-[#00B5DE] py-3 px-4 mr-4 rounded-lg">
              <svg xmlns="http://www.w3.org/2000/svg"  width="24" height="24" viewBox="0 0 24 24" fill="none">
                <path d="M9 5H7C5.89543 5 5 5.89543 5 7V19C5 20.1046 5.89543 21 7 21H17C18.1046 21 19 20.1046 19 19V7C19 5.89543 18.1046 5 17 5H15M9 5C9 6.10457 9.89543 7 11 7H13C14.1046 7 15 6.10457 15 5M9 5C9 3.89543 9.89543 3 11 3H13C14.1046 3 15 3.89543 15 5M12 12H15M12 16H15M9 12H9.01M9 16H9.01" stroke="white" stroke-width="2" stroke-linecap="round"/>
              </svg>
            </div>
            <div>
              <p class="text-[#6B7280]">Пользователи</p>
              <h4 class="flex items-center"><span class="text-2xl font-semibold">32</span><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M14.7068 10.2932C14.8946 10.4807 15 10.735 15 11.0002C15 11.2654 14.8946 11.5197 14.7068 11.7072L10.7018 15.7072C10.5141 15.8947 10.2595 16 9.99396 16C9.72846 16 9.47383 15.8947 9.28607 15.7072L5.28106 11.7072C5.09868 11.5186 4.99776 11.266 5.00004 11.0038C5.00232 10.7416 5.10762 10.4908 5.29326 10.3054C5.4789 10.12 5.73003 10.0148 5.99255 10.0125C6.25508 10.0103 6.50799 10.1111 6.69683 10.2932L8.9927 12.5862V5.00021C8.9927 4.735 9.09819 4.48064 9.28596 4.29311C9.47373 4.10557 9.72841 4.00021 9.99396 4.00021C10.2595 4.00021 10.5142 4.10557 10.7019 4.29311C10.8897 4.48064 10.9952 4.735 10.9952 5.00021V12.5862L13.2911 10.2932C13.4788 10.1057 13.7335 10.0004 13.999 10.0004C14.2645 10.0004 14.5191 10.1057 14.7068 10.2932Z" fill="#EF4444"/>
              </svg><span class="text-sm text-red-500 font-semibold">2</span></h4>
            </div>
          </div>
          <div class="bg-[#F9FAFB] rounded-b-lg p-4">
            <a href="#" class="hover:underline">Все</a>
          </div>
        </div>
        <div class="bg-white rounded-lg">
          <div class="flex px-4 py-5">
            <div class="flex items-center bg-[#FDB913] py-3 px-4 mr-4 rounded-lg">
              <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
              <path d="M17.667 20H22.667V18C22.667 16.3431 21.3238 15 19.667 15C18.7114 15 17.8601 15.4468 17.3107 16.1429M17.667 20H7.66699M17.667 20V18C17.667 17.3438 17.5406 16.717 17.3107 16.1429M7.66699 20H2.66699V18C2.66699 16.3431 4.01014 15 5.66699 15C6.6226 15 7.47385 15.4468 8.02324 16.1429M7.66699 20V18C7.66699 17.3438 7.79342 16.717 8.02324 16.1429M8.02324 16.1429C8.76049 14.301 10.5618 13 12.667 13C14.7722 13 16.5735 14.301 17.3107 16.1429M15.667 7C15.667 8.65685 14.3238 10 12.667 10C11.0101 10 9.66699 8.65685 9.66699 7C9.66699 5.34315 11.0101 4 12.667 4C14.3238 4 15.667 5.34315 15.667 7ZM21.667 10C21.667 11.1046 20.7716 12 19.667 12C18.5624 12 17.667 11.1046 17.667 10C17.667 8.89543 18.5624 8 19.667 8C20.7716 8 21.667 8.89543 21.667 10ZM7.66699 10C7.66699 11.1046 6.77156 12 5.66699 12C4.56242 12 3.66699 11.1046 3.66699 10C3.66699 8.89543 4.56242 8 5.66699 8C6.77156 8 7.66699 8.89543 7.66699 10Z" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div>
              <p class="text-[#6B7280]">Организации</p>
              <h4 class="flex items-center"><span class="text-2xl font-semibold">164</span><svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M5.96015 9.70679C5.77244 9.51926 5.66699 9.26495 5.66699 8.99979C5.66699 8.73462 5.77244 8.48031 5.96015 8.29279L9.96515 4.29279C10.1529 4.10532 10.4075 4 10.673 4C10.9385 4 11.1932 4.10532 11.3809 4.29279L15.3859 8.29279C15.5683 8.48139 15.6692 8.73399 15.667 8.99619C15.6647 9.25838 15.5594 9.5092 15.3737 9.6946C15.1881 9.88001 14.937 9.98518 14.6744 9.98746C14.4119 9.98974 14.159 9.88894 13.9702 9.70679L11.6743 7.41379V14.9998C11.6743 15.265 11.5688 15.5194 11.381 15.7069C11.1933 15.8944 10.9386 15.9998 10.673 15.9998C10.4075 15.9998 10.1528 15.8944 9.96504 15.7069C9.77727 15.5194 9.67178 15.265 9.67178 14.9998V7.41379L7.37591 9.70679C7.18815 9.89426 6.93353 9.99957 6.66803 9.99957C6.40253 9.99957 6.14791 9.89426 5.96015 9.70679Z" fill="#10B981"/>
            </svg><span class="text-sm text-green-500 font-semibold">12</span></h4>
            </div>
          </div>
          <div class="bg-[#F9FAFB] rounded-b-lg p-4">
            <a href="#" class="hover:underline">Все</a>
          </div>
        </div>
        <div class="bg-white rounded-lg">
          <div class="flex px-4 py-5">
            <div class="flex items-center bg-[#00B8A5] py-3 px-4 mr-4 rounded-lg">
              <svg xmlns="http://www.w3.org/2000/svg"  width="24" height="24" viewBox="0 0 24 24" fill="none">
                <path d="M9 5H7C5.89543 5 5 5.89543 5 7V19C5 20.1046 5.89543 21 7 21H17C18.1046 21 19 20.1046 19 19V7C19 5.89543 18.1046 5 17 5H15M9 5C9 6.10457 9.89543 7 11 7H13C14.1046 7 15 6.10457 15 5M9 5C9 3.89543 9.89543 3 11 3H13C14.1046 3 15 3.89543 15 5M12 12H15M12 16H15M9 12H9.01M9 16H9.01" stroke="white" stroke-width="2" stroke-linecap="round"/>
              </svg>
            </div>
            <div>
              <p class="text-[#6B7280]">Скриннинг</p>
              <h4 class="flex items-center"><span class="text-2xl font-semibold">3245</span><svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M5.96015 9.70679C5.77244 9.51926 5.66699 9.26495 5.66699 8.99979C5.66699 8.73462 5.77244 8.48031 5.96015 8.29279L9.96515 4.29279C10.1529 4.10532 10.4075 4 10.673 4C10.9385 4 11.1932 4.10532 11.3809 4.29279L15.3859 8.29279C15.5683 8.48139 15.6692 8.73399 15.667 8.99619C15.6647 9.25838 15.5594 9.5092 15.3737 9.6946C15.1881 9.88001 14.937 9.98518 14.6744 9.98746C14.4119 9.98974 14.159 9.88894 13.9702 9.70679L11.6743 7.41379V14.9998C11.6743 15.265 11.5688 15.5194 11.381 15.7069C11.1933 15.8944 10.9386 15.9998 10.673 15.9998C10.4075 15.9998 10.1528 15.8944 9.96504 15.7069C9.77727 15.5194 9.67178 15.265 9.67178 14.9998V7.41379L7.37591 9.70679C7.18815 9.89426 6.93353 9.99957 6.66803 9.99957C6.40253 9.99957 6.14791 9.89426 5.96015 9.70679Z" fill="#10B981"/>
            </svg><span class="text-sm text-green-500 font-semibold">56</span></h4>
            </div>
          </div>
          <div class="bg-[#F9FAFB] rounded-b-lg p-4">
            <a href="#" class="hover:underline">Все</a>
          </div>
        </div>
        <div class="bg-white rounded-lg">
          <div class="flex px-4 py-5">
            <div class="flex items-center bg-[#80C342] py-3 px-4 mr-4 rounded-lg">
              <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <path d="M16 7C16 9.20914 14.2091 11 12 11C9.79086 11 8 9.20914 8 7C8 4.79086 9.79086 3 12 3C14.2091 3 16 4.79086 16 7Z" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                <path d="M12 14C8.13401 14 5 17.134 5 21H19C19 17.134 15.866 14 12 14Z" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div>
              <p class="text-[#6B7280]">Клиенты</p>
              <h4 class="flex items-center"><span class="text-2xl font-semibold">571</span><svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M5.96015 9.70679C5.77244 9.51926 5.66699 9.26495 5.66699 8.99979C5.66699 8.73462 5.77244 8.48031 5.96015 8.29279L9.96515 4.29279C10.1529 4.10532 10.4075 4 10.673 4C10.9385 4 11.1932 4.10532 11.3809 4.29279L15.3859 8.29279C15.5683 8.48139 15.6692 8.73399 15.667 8.99619C15.6647 9.25838 15.5594 9.5092 15.3737 9.6946C15.1881 9.88001 14.937 9.98518 14.6744 9.98746C14.4119 9.98974 14.159 9.88894 13.9702 9.70679L11.6743 7.41379V14.9998C11.6743 15.265 11.5688 15.5194 11.381 15.7069C11.1933 15.8944 10.9386 15.9998 10.673 15.9998C10.4075 15.9998 10.1528 15.8944 9.96504 15.7069C9.77727 15.5194 9.67178 15.265 9.67178 14.9998V7.41379L7.37591 9.70679C7.18815 9.89426 6.93353 9.99957 6.66803 9.99957C6.40253 9.99957 6.14791 9.89426 5.96015 9.70679Z" fill="#10B981"/>
            </svg><span class="text-sm text-green-500 font-semibold">13</span></h4>
            </div>
          </div>
          <div class="bg-[#F9FAFB] rounded-b-lg p-4">
            <a href="#" class="hover:underline">Все</a>
          </div>
        </div>
        <div class="bg-white rounded-lg">
          <div class="flex px-4 py-5">
            <div class="flex items-center bg-[#F04E5B] py-3 px-4 mr-4 rounded-lg">
              <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
                <path d="M17.667 20H22.667V18C22.667 16.3431 21.3238 15 19.667 15C18.7114 15 17.8601 15.4468 17.3107 16.1429M17.667 20H7.66699M17.667 20V18C17.667 17.3438 17.5406 16.717 17.3107 16.1429M7.66699 20H2.66699V18C2.66699 16.3431 4.01014 15 5.66699 15C6.6226 15 7.47385 15.4468 8.02324 16.1429M7.66699 20V18C7.66699 17.3438 7.79342 16.717 8.02324 16.1429M8.02324 16.1429C8.76049 14.301 10.5618 13 12.667 13C14.7722 13 16.5735 14.301 17.3107 16.1429M15.667 7C15.667 8.65685 14.3238 10 12.667 10C11.0101 10 9.66699 8.65685 9.66699 7C9.66699 5.34315 11.0101 4 12.667 4C14.3238 4 15.667 5.34315 15.667 7ZM21.667 10C21.667 11.1046 20.7716 12 19.667 12C18.5624 12 17.667 11.1046 17.667 10C17.667 8.89543 18.5624 8 19.667 8C20.7716 8 21.667 8.89543 21.667 10ZM7.66699 10C7.66699 11.1046 6.77156 12 5.66699 12C4.56242 12 3.66699 11.1046 3.66699 10C3.66699 8.89543 4.56242 8 5.66699 8C6.77156 8 7.66699 8.89543 7.66699 10Z" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div>
              <p class="text-[#6B7280]">Выданные купоны</p>
              <h4 class="flex items-center"><span class="text-2xl font-semibold">32</span><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M14.7068 10.2932C14.8946 10.4807 15 10.735 15 11.0002C15 11.2654 14.8946 11.5197 14.7068 11.7072L10.7018 15.7072C10.5141 15.8947 10.2595 16 9.99396 16C9.72846 16 9.47383 15.8947 9.28607 15.7072L5.28106 11.7072C5.09868 11.5186 4.99776 11.266 5.00004 11.0038C5.00232 10.7416 5.10762 10.4908 5.29326 10.3054C5.4789 10.12 5.73003 10.0148 5.99255 10.0125C6.25508 10.0103 6.50799 10.1111 6.69683 10.2932L8.9927 12.5862V5.00021C8.9927 4.735 9.09819 4.48064 9.28596 4.29311C9.47373 4.10557 9.72841 4.00021 9.99396 4.00021C10.2595 4.00021 10.5142 4.10557 10.7019 4.29311C10.8897 4.48064 10.9952 4.735 10.9952 5.00021V12.5862L13.2911 10.2932C13.4788 10.1057 13.7335 10.0004 13.999 10.0004C14.2645 10.0004 14.5191 10.1057 14.7068 10.2932Z" fill="#EF4444"/>
              </svg><span class="text-sm text-red-500 font-semibold">16</span></h4>
            </div>
          </div>
          <div class="bg-[#F9FAFB] rounded-b-lg p-4">
            <a href="#" class="hover:underline">Все</a>
          </div>
        </div>
        <div class="bg-white rounded-lg">
          <div class="flex px-4 py-5">
            <div class="flex items-center bg-[#975CA5] py-3 px-4 mr-4 rounded-lg">
              <svg xmlns="http://www.w3.org/2000/svg"  width="24" height="24" viewBox="0 0 24 24" fill="none">
                <path d="M9 5H7C5.89543 5 5 5.89543 5 7V19C5 20.1046 5.89543 21 7 21H17C18.1046 21 19 20.1046 19 19V7C19 5.89543 18.1046 5 17 5H15M9 5C9 6.10457 9.89543 7 11 7H13C14.1046 7 15 6.10457 15 5M9 5C9 3.89543 9.89543 3 11 3H13C14.1046 3 15 3.89543 15 5M12 12H15M12 16H15M9 12H9.01M9 16H9.01" stroke="white" stroke-width="2" stroke-linecap="round"/>
              </svg>
            </div>
            <div>
              <p class="text-[#6B7280]">Выданные вознаграждения</p>
              <h4 class="flex items-center"><span class="text-2xl font-semibold">64</span><svg xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M5.96015 9.70679C5.77244 9.51926 5.66699 9.26495 5.66699 8.99979C5.66699 8.73462 5.77244 8.48031 5.96015 8.29279L9.96515 4.29279C10.1529 4.10532 10.4075 4 10.673 4C10.9385 4 11.1932 4.10532 11.3809 4.29279L15.3859 8.29279C15.5683 8.48139 15.6692 8.73399 15.667 8.99619C15.6647 9.25838 15.5594 9.5092 15.3737 9.6946C15.1881 9.88001 14.937 9.98518 14.6744 9.98746C14.4119 9.98974 14.159 9.88894 13.9702 9.70679L11.6743 7.41379V14.9998C11.6743 15.265 11.5688 15.5194 11.381 15.7069C11.1933 15.8944 10.9386 15.9998 10.673 15.9998C10.4075 15.9998 10.1528 15.8944 9.96504 15.7069C9.77727 15.5194 9.67178 15.265 9.67178 14.9998V7.41379L7.37591 9.70679C7.18815 9.89426 6.93353 9.99957 6.66803 9.99957C6.40253 9.99957 6.14791 9.89426 5.96015 9.70679Z" fill="#10B981"/>
            </svg><span class="text-sm text-green-500 font-semibold">3</span></h4>
            </div>
          </div>
          <div class="bg-[#F9FAFB] rounded-b-lg p-4">
            <a href="#" class="hover:underline">Все</a>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
import Header from '~/components/ui/header.vue'
export default {
  layout: 'sidebar',
  components: {
    Header,
  }
};
</script>

